second-project/data/h2load/Youtube/output.Youtube-16.txt
starting benchmark...
spawning thread #0: 16 total client(s). Timing-based test with 1s of warm-up time and 30s of main duration for measurements.
Warm-up started for thread #0.
progress: 6% of clients started
progress: 12% of clients started
progress: 18% of clients started
progress: 25% of clients started
progress: 31% of clients started
progress: 37% of clients started
progress: 43% of clients started
progress: 50% of clients started
progress: 56% of clients started
progress: 62% of clients started
progress: 68% of clients started
progress: 75% of clients started
progress: 81% of clients started
progress: 87% of clients started
progress: 93% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_256_GCM_SHA384
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 31.00s, 0.40 req/s, 441.85KB/s
requests: 12 total, 12 started, 12 done, 12 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 21 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 12.94MB (13573711) total, 24.35KB (24937) headers (space savings 46.28%), 13.08MB (13719324) data
                     min         max         mean         sd        +/- sd
time for request:     11.73s      25.24s      20.40s       4.50s    75.00%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :       0.00        0.07        0.02        0.02    62.50%
starting benchmark...
spawning thread #0: 16 total client(s). Timing-based test with 2s of warm-up time and 30s of main duration for measurements.
Warm-up started for thread #0.
progress: 6% of clients started
progress: 12% of clients started
progress: 18% of clients started
progress: 25% of clients started
progress: 31% of clients started
progress: 37% of clients started
progress: 43% of clients started
progress: 50% of clients started
progress: 56% of clients started
progress: 62% of clients started
progress: 68% of clients started
progress: 75% of clients started
progress: 81% of clients started
progress: 87% of clients started
progress: 93% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_256_GCM_SHA384
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 32.00s, 0.30 req/s, 467.63KB/s
requests: 9 total, 10 started, 9 done, 9 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 11 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 13.70MB (14365640) total, 23.11KB (23669) headers (space savings 42.85%), 13.83MB (14505946) data
                     min         max         mean         sd        +/- sd
time for request:      6.39s      25.15s      12.69s       5.69s    77.78%
time for connect:      7.23s       7.23s       7.23s         0us   100.00%
time to 1st byte:      7.58s       7.58s       7.58s         0us   100.00%
req/s           :       0.00        0.07        0.02        0.03    81.25%
starting benchmark...
spawning thread #0: 16 total client(s). Timing-based test with 4s of warm-up time and 30s of main duration for measurements.
Warm-up started for thread #0.
progress: 6% of clients started
progress: 12% of clients started
progress: 18% of clients started
progress: 25% of clients started
progress: 31% of clients started
progress: 37% of clients started
progress: 43% of clients started
progress: 50% of clients started
progress: 56% of clients started
progress: 62% of clients started
progress: 68% of clients started
progress: 75% of clients started
progress: 81% of clients started
progress: 87% of clients started
progress: 93% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_256_GCM_SHA384
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 34.00s, 0.43 req/s, 465.27KB/s
requests: 13 total, 13 started, 13 done, 13 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 13 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 13.63MB (14293185) total, 24.57KB (25161) headers (space savings 47.51%), 15.25MB (15993460) data
                     min         max         mean         sd        +/- sd
time for request:      3.95s      32.39s      16.20s       9.65s    69.23%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :       0.00        0.07        0.03        0.02    56.25%
starting benchmark...
spawning thread #0: 16 total client(s). Timing-based test with 8s of warm-up time and 30s of main duration for measurements.
Warm-up started for thread #0.
progress: 6% of clients started
progress: 12% of clients started
progress: 18% of clients started
progress: 25% of clients started
progress: 31% of clients started
progress: 37% of clients started
progress: 43% of clients started
progress: 50% of clients started
progress: 56% of clients started
progress: 62% of clients started
progress: 68% of clients started
progress: 75% of clients started
progress: 81% of clients started
progress: 87% of clients started
progress: 93% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_256_GCM_SHA384
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 38.00s, 0.27 req/s, 359.62KB/s
requests: 8 total, 8 started, 8 done, 8 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 8 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 10.54MB (11047547) total, 22.51KB (23055) headers (space savings 41.99%), 12.00MB (12586137) data
                     min         max         mean         sd        +/- sd
time for request:     10.39s      36.56s      23.47s      10.21s    50.00%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :       0.00        0.07        0.02        0.02    93.75%
starting benchmark...
spawning thread #0: 16 total client(s). Timing-based test with 16s of warm-up time and 30s of main duration for measurements.
Warm-up started for thread #0.
progress: 6% of clients started
progress: 12% of clients started
progress: 18% of clients started
progress: 25% of clients started
progress: 31% of clients started
progress: 37% of clients started
progress: 43% of clients started
progress: 50% of clients started
progress: 56% of clients started
progress: 62% of clients started
progress: 68% of clients started
progress: 75% of clients started
progress: 81% of clients started
progress: 87% of clients started
progress: 93% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_256_GCM_SHA384
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 46.00s, 0.73 req/s, 596.62KB/s
requests: 22 total, 22 started, 22 done, 22 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 23 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 17.48MB (18328273) total, 30.83KB (31575) headers (space savings 55.99%), 25.27MB (26500302) data
                     min         max         mean         sd        +/- sd
time for request:      5.20s      42.31s      19.65s      10.06s    81.82%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :       0.00        0.07        0.05        0.02    50.00%